"""
语法：
列表[下表索引值]
"""

name_list = ["周杰伦","林俊杰","王力宏"]
print(name_list[0])   # 取出第一个元素，下标是0
print(name_list[1])
print(name_list[2])


# 反向下标  从右到左  -1,-2,-3,-4,-5 逆减
lst = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]
print(lst[-1])
print(lst[-2])
print(lst[-3])


"""
列表的下标
[  1,  2,  3,  4,  5,  6,]
   0   1   2   3   4   5   正向下标
   -6  -5  -4  -3  -2  -1  反向下标
"""

print("-"*20)
lst1 = [[1,2,3],[4,5,6],[7,8,9]]
print(lst1[0][-1])
print(lst1[1][-1])

list3 = [
    [
        [1,2,3],
        [4,5,6]
    ],
    [
        [7,8,9],
        [10,11,12]
    ]
]

print(list3[1][1][1])