d = {
    "周杰伦":{"语文":99,"英语":53,"数学":34},
    "林俊杰":{"语文":36,"英语":61,"数学":74},
    "王力宏":{"语文":61,"英语":32,"数学":34}
}

# 新增元素
d["刘德华"] = {"语文":61,"英语":32,"数学":34}
print(d)

# 更新元素
d["王力宏"] = {"语文":100,"英语":100,"数学":100}
print(d)
# 更新和新增语法一致， 当key不存在新增，当key存在则更新

# 删除某个key，并将其对应的value作为返回值提供
liudehua = d.pop("刘德华")
print(liudehua)

# 清空
d.clear()
print(d)
d = {"a":1,"b":2,"c":3,"d":4,"e":5}
d = {}   # 方法2
print(d)

d = {
    "周杰伦":{"语文":99,"英语":53,"数学":34},
    "林俊杰":{"语文":36,"英语":61,"数学":74},
    "王力宏":{"语文":61,"英语":32,"数学":34}
}

print(d.keys())  # 结果 dict_keys(['周杰伦', '林俊杰', '王力宏'])
# 字典.keys的结果可以被遍历

# 遍历字典
for key in d.keys():
    print(f"{key}: {d[key]}")

print("-"*20)
# 方式2遍历字典
for key in d:
    print(f"{key}: {d[key]}")

# 得到字典长度  (有多少个键值对)
print(len(d))
