
# bool类型本身，2个字面量
v1 = True
v2 = False
print(type(v1),type(v2))

print("\n")


# 可以通过比较运算符得到布尔结果
# == 相等判断
print("-"*20,"==判断")
print("itheima 等于 itcast 吗？ %s" % ("itheima" == "itcast"))
print("5 = 5.0 吗? %s" % (5 == 5.0))
print('"5" = "5.0" 吗? %s' % ("5" == "5.0"))


print("\n")
#  != 不相等判断
print("-"*20,"!=判断")
print("itheima 不等于 itcast 吗？ %s" % ("itheima" != "itcast"))
print("5 != 5.0 吗? %s" % (5 != 5.0))
print('"5" != "5.0" 吗? %s' % ("5" != "5.0"))

print("\n")
#  > <  >=  <= 判断
print("-"*20,"> <  >=  <= 判断")
print("5 > 5 ? = %s" % (5>5))
print("5 < 5 ? = %s" % (5<5))
print("5 >= 4 ? = %s" % (5>=4))
print("5 <= 4 ? = %s" % (5<=4))

print("\n")
#  字符串比较
print("-"*20,"字符串比较")
"""
字符串比较是按位比较，第一位和对方第一位比较，如果出结果后续不比了，如果没有结果继续向后比
条件：
"1" < "2"  ...
"a" < "b"  ...
"A" < "B"  ...
无内容 < 有内容  比如: a 和 aa 大的是aa

"12" > "11"  True
"12" > "123"  False

详细比较关系，需要参考ASCII码表
"""

print('"12" > "5" ? = %s' % ("12" > "5"))


